;************************************************************************************************************
; SPARTAN-II CLASS
;************************************************************************************************************
[SPARTAN-II_SSV X2SoldierClassTemplate]
+DisplayName="SPARTAN-II"
+ClassSummary="The SPARTAN-II Program, originally known as the ORION Project Generation II, was part of the SPARTAN Program, an effort to produce elite soldiers through mechanical and biological augmentation. The SPARTAN-II program would be the first in the series to meld advanced exoskeleton technology with the soldiers' superior physiques."
+LeftAbilityTreeTitle="SPARTAN"
+RightAbilityTreeTitle="Augmentations"
+AbilityTreeTitles[0]="SPARTAN-II"
+AbilityTreeTitles[1]="Sniper"
+AbilityTreeTitles[2]="Gunslinger"
+AbilityTreeTitles[3]="Demolition Expert"
+AbilityTreeTitles[4]="Heavy Gunner"
+AbilityTreeTitles[5]="Scout"
+AbilityTreeTitles[6]="Blade Master"


;ALPHABETICAL ORDER
+RandomNickNames[0]="Demon"
+RandomNickNames[1]="Reclaimer"
+RandomNickNames[2]="Lawbringer"
+RandomNickNames[3]="Centurion"
+RandomNickNames[4]="Warden"
+RandomNickNames[5]="Raider"
+RandomNickNames[6]="Conqueror"
+RandomNickNames[7]="Warlord"
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]="Valkyrie"
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""

+RankNames[0]="Crewman Recruit"
+RankNames[1]="Crewman Apprentice"
+RankNames[2]="Crewman"
+RankNames[3]="Petty Officer Third Class"
+RankNames[4]="Petty Officer Second Class"
+RankNames[5]="Petty Officer First Class"
+RankNames[6]="Chief Petty Officer"
+RankNames[7]="Senior Chief Petty Officer"
+RankNames[8]="Master Chief Petty Officer"

+ShortNames[0]="CR"
+ShortNames[1]="CA"
+ShortNames[2]="CN"
+ShortNames[3]="PO3"
+ShortNames[4]="PO2"
+ShortNames[5]="PO1"
+ShortNames[6]="CPO"
+ShortNames[7]="SCPO"
+ShortNames[8]="MCPO"

;************************************************************************************************************
; Nanosuit CLASS
;************************************************************************************************************
[Nanosuit_SSV X2SoldierClassTemplate]
+DisplayName="Nanosuit Operative"
+ClassSummary="Nanosuits (also known as Nano-muscle suits) are powerful and extremely versatile sets of tactical-combat armor. The suits' CryFibril muscle fibers can be programmed for a variety of purposes (such as hardening, muscle augmentation or camouflage), leading to drastically enhanced combat and physical performance, allowing the operator to execute superhuman feats. All nanosuits are symbiotic, meaning that they physically bond with the user and become a form of second skin. The suits and the users eventually merge into one being."
+LeftAbilityTreeTitle="Nanosuit"
+RightAbilityTreeTitle="Raptor"
+AbilityTreeTitles[0]="Nanosuit"
+AbilityTreeTitles[1]="Sniper"
+AbilityTreeTitles[2]="Gunslinger"
+AbilityTreeTitles[3]="Demolition Expert"
+AbilityTreeTitles[4]="Heavy Gunner"
+AbilityTreeTitles[5]="Scout"
+AbilityTreeTitles[6]="Blade Master"


;ALPHABETICAL ORDER
+RandomNickNames[0]="Prophet"
+RandomNickNames[1]="Nomad"
+RandomNickNames[2]="Alcatraz"
+RandomNickNames[3]="Hunter"
+RandomNickNames[4]="Psycho"
+RandomNickNames[5]="Ranger"
+RandomNickNames[6]="Zero"
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; Ghost CLASS
;************************************************************************************************************
[Ghost_SSV X2SoldierClassTemplate]
+DisplayName="Ghost Operative"
+ClassSummary="Ghosts were chosen from psychically-gifted individuals trained from infancy to channel their psionic energies to augment their natural physical strength and endurance. Conscripts who successfully completed the Ghost Program's rigorous training and augmentations then served as commandos and assassins. Ghosts are unrivaled in their ability to infiltrate and assassinate."
+LeftAbilityTreeTitle="Ghost"
+RightAbilityTreeTitle="Psion"
+AbilityTreeTitles[0]="Ghost"
+AbilityTreeTitles[1]="Psionics"
+AbilityTreeTitles[2]="Sniper"
+AbilityTreeTitles[3]="Gunslinger"
+AbilityTreeTitles[4]="Scout"
+AbilityTreeTitles[5]="Blade Master"


;ALPHABETICAL ORDER
+RandomNickNames[0]="Hunter"
+RandomNickNames[1]="Deadshot"
+RandomNickNames[2]="Solo"
+RandomNickNames[3]="Rogue"
+RandomNickNames[4]="Reaper"
+RandomNickNames[5]="Ghost"
+RandomNickNames[6]="Spectre"
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]="Apollo"
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]="Queen"
+RandomNickNames_Female[1]="Nova"
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; Ninja
;************************************************************************************************************
[Ninja_SSV X2SoldierClassTemplate]
+DisplayName="Ninja"
+ClassSummary="The Ninjas are elite warriors who use their highly advanced techniques and skills to perform tasks such as espionage, combat operations, and assassinations. Their training starts very early in life and only after completing tests and training so intense it cannot be described using words they reach their true potential. All members are specialists of extreme skill and knowledge of the mystic arts."
+LeftAbilityTreeTitle="Shinobi"
+RightAbilityTreeTitle="Shadow"
+AbilityTreeTitles[0]="Ninjutsu Arts"
+AbilityTreeTitles[1]="Ninpo Arts"
+AbilityTreeTitles[2]="Blade Arts"
+AbilityTreeTitles[3]="Improvisation Arts"
+AbilityTreeTitles[4]="Utility"

;ALPHABETICAL ORDER
+RandomNickNames[0]="Shadow"
+RandomNickNames[1]="Assassin"
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]="Dragon"
+RandomNickNames_Male[1]="Wind"
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]="Destiny"
+RandomNickNames_Female[1]="Killer"
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""

+RankNames[0]="Ninja Recruit"
+RankNames[1]="Ninja Apprentice"
+RankNames[2]="Lesser Ninja"
+RankNames[3]="Common Ninja"
+RankNames[4]="Advanced Ninja"
+RankNames[5]="Greater Ninja"
+RankNames[6]="Elite Ninja"
+RankNames[7]="Master Ninja"
+RankNames[8]="Ultimate Ninja"


+ShortNames[0]="NJR"
+ShortNames[1]="NJA"
+ShortNames[2]="LNJ"
+ShortNames[3]="CNJ"
+ShortNames[4]="ANJ"
+ShortNames[5]="GNJ"
+ShortNames[6]="ENJ"
+ShortNames[7]="MNJ"
+ShortNames[8]="UNJ"


;************************************************************************************************************
; Cyborg CLASS
;************************************************************************************************************
[Cyborg_SSV X2SoldierClassTemplate]
+DisplayName="Cyborg"
+ClassSummary="A cybernetic organism, more commonly known and referred to as a Cyborg, is a being that has both biological and artificial parts. The machine components are different from prosthetics, as they not only substitute the replaced body parts, but also enhance them in various ways. Cyborgs are equipped with an exoskeleton - full-body non-removable cybernetics - that offer various advantages. Their body comes with an installed Combat-Energy system that allow them to overcome various scenarios in the battlefield but their available energy is limited per mission."
+LeftAbilityTreeTitle="Cyborg"
+RightAbilityTreeTitle="DeusEx"
+AbilityTreeTitles[0]="Cyborg"
+AbilityTreeTitles[1]="Sniper"
+AbilityTreeTitles[2]="Gunslinger"
+AbilityTreeTitles[3]="Demolition Expert"
+AbilityTreeTitles[4]="Heavy Gunner"
+AbilityTreeTitles[5]="Scout"
+AbilityTreeTitles[6]="Blade Master"
+AbilityTreeTitles[7]="Hacker"


;ALPHABETICAL ORDER
+RandomNickNames[0]="Berserker"
+RandomNickNames[1]="Deus-Ex"
+RandomNickNames[2]="Metallo"
+RandomNickNames[3]="Project"
+RandomNickNames[4]="Cable"
+RandomNickNames[5]="Juggernaut"
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; N7 Soldier CLASS
;************************************************************************************************************
[N7Soldier_SSV X2SoldierClassTemplate]
+DisplayName="N7 Destroyer Soldier"
+ClassSummary="These soldiers are the go-anywhere, fight-anything special forces of the Alliance that were trained at the Interplanetary Combatives Academy in Rio de Janeiro, Brazil. They had to survive combat situations in an admirable and effective fashion to receive the N7 rank. The Destroyer Soldiers are the full spectrum warriors of the squad whose talents focus on improving durability and damage. Their Adrenaline Rush ability dramatically improves their combat effectiveness."
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="Soldier"
+AbilityTreeTitles[0]="N7 Destroyer Soldier"
+AbilityTreeTitles[1]="Sniper"
+AbilityTreeTitles[2]="Gunslinger"
+AbilityTreeTitles[3]="Demolition Expert"
+AbilityTreeTitles[4]="Heavy Gunner"
+AbilityTreeTitles[5]="Scout"
+AbilityTreeTitles[6]="Blade Master"
+AbilityTreeTitles[7]="Hacker"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; N7 Infiltrator CLASS
;************************************************************************************************************
[N7Infiltrator_SSV X2SoldierClassTemplate]
+DisplayName="N7 Shadow Infiltrator"
+ClassSummary="These soldiers are the go-anywhere, fight-anything special forces of the Alliance that were trained at the Interplanetary Combatives Academy in Rio de Janeiro, Brazil. They had to survive combat situations in an admirable and effective fashion to receive the N7 rank. The Shadow Infiltrators use implants to improve agility, making them slippery combatants on the battlefield. Their Tactical Cloak is an invaluable tool that dramatically increases their assassination, infiltration as well as survival potential in the battlefield."
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="Infiltrator"
+AbilityTreeTitles[0]="N7 Shadow Infiltrator"
+AbilityTreeTitles[1]="Sniper"
+AbilityTreeTitles[2]="Gunslinger"
+AbilityTreeTitles[3]="Demolition Expert"
+AbilityTreeTitles[4]="Heavy Gunner"
+AbilityTreeTitles[5]="Scout"
+AbilityTreeTitles[6]="Blade Master"
+AbilityTreeTitles[7]="Hacker"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; N7 Engineer CLASS
;************************************************************************************************************
[N7Engineer_SSV X2SoldierClassTemplate]
+DisplayName="N7 Demolisher Engineer"
+ClassSummary="These soldiers are the go-anywhere, fight-anything special forces of the Alliance that were trained at the Interplanetary Combatives Academy in Rio de Janeiro, Brazil. They had to survive combat situations in an admirable and effective fashion to receive the N7 rank. The Demolisher Engineer has increased tech damage and gains access to a continuous supply of explosive grenades to further increase his destructive capabilities. He is capable of disabling priority targets and uses grenades to attack at range and to terrorize the battlefield."
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="Engineer"
+AbilityTreeTitles[0]="N7 Demolisher Engineer"
+AbilityTreeTitles[1]="Sniper"
+AbilityTreeTitles[2]="Gunslinger"
+AbilityTreeTitles[3]="Demolition Expert"
+AbilityTreeTitles[4]="Heavy Gunner"
+AbilityTreeTitles[5]="Scout"
+AbilityTreeTitles[6]="Blade Master"
+AbilityTreeTitles[7]="Hacker"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; N7 Adept CLASS
;************************************************************************************************************
[N7Adept_SSV X2SoldierClassTemplate]
+DisplayName="N7 Fury Adept"
+ClassSummary="These soldiers are the go-anywhere, fight-anything special forces of the Alliance that were trained at the Interplanetary Combatives Academy in Rio de Janeiro, Brazil. They had to survive combat situations in an admirable and effective fashion to receive the N7 rank. The Fury Adepts are the ultimate biotics, able to affect the physical world with the power of the mind. Adepts are durable and powerful manipulators of mass effect fields. They can use biotics to violently manipulate objects in the environment, including nearby enemy targets."
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="Adept"
+AbilityTreeTitles[0]="N7 Biotics"
+AbilityTreeTitles[1]="N7 Fury Adept"
+AbilityTreeTitles[2]="N7 Vanguard Biotics"
+AbilityTreeTitles[3]="Sniper"
+AbilityTreeTitles[4]="Gunslinger"
+AbilityTreeTitles[5]="Demolition Expert"
+AbilityTreeTitles[6]="Heavy Gunner"
+AbilityTreeTitles[7]="Scout"
+AbilityTreeTitles[8]="Blade Master"
+AbilityTreeTitles[9]="Hacker"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""

;************************************************************************************************************
; N7 Vanguard CLASS
;************************************************************************************************************
[N7Vanguard_SSV X2SoldierClassTemplate]
+DisplayName="N7 Slayer Vanguard"
+ClassSummary="These soldiers are the go-anywhere, fight-anything special forces of the Alliance that were trained at the Interplanetary Combatives Academy in Rio de Janeiro, Brazil. They had to survive combat situations in an admirable and effective fashion to receive the N7 rank. The Slayer Vanguards are powerful combatants, able to combine the offensive powers of the Adept and the Soldier. They have access to various weapon buffs as well as biotic abilities."
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="Vanguard"
+AbilityTreeTitles[0]="N7 Biotics"
+AbilityTreeTitles[1]="N7 Adept Biotics"
+AbilityTreeTitles[2]="N7 Slayer Vanguard"
+AbilityTreeTitles[3]="Sniper"
+AbilityTreeTitles[4]="Gunslinger"
+AbilityTreeTitles[5]="Demolition Expert"
+AbilityTreeTitles[6]="Heavy Gunner"
+AbilityTreeTitles[7]="Scout"
+AbilityTreeTitles[8]="Blade Master"
+AbilityTreeTitles[9]="Hacker"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""

;************************************************************************************************************
; N7 Sentinel CLASS
;************************************************************************************************************
[N7Sentinel_SSV X2SoldierClassTemplate]
+DisplayName="N7 Paladin Sentinel"
+ClassSummary="These soldiers are the go-anywhere, fight-anything special forces of the Alliance that were trained at the Interplanetary Combatives Academy in Rio de Janeiro, Brazil. They had to survive combat situations in an admirable and effective fashion to receive the N7 rank. The N7 Paladin Sentinel carries a powerful shield onto the battlefield to block enemy fire. The Paladin also uses the shield as a heavy-melee weapon."
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="Sentinel"
+AbilityTreeTitles[0]="N7 Paladin Sentinel"
+AbilityTreeTitles[1]="Sniper"
+AbilityTreeTitles[2]="Gunslinger"
+AbilityTreeTitles[3]="Demolition Expert"
+AbilityTreeTitles[4]="Heavy Gunner"
+AbilityTreeTitles[5]="Scout"
+AbilityTreeTitles[6]="Blade Master"
+AbilityTreeTitles[7]="Hacker"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""